<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/1999/REC-html401-19991224/loose.dtd">

<HTML> 

<!-- Mirrored from archive.webstandards.org/faqspanish.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 18 Aug 2017 18:20:16 GMT -->
<HEAD>

<TITLE>Proyecto de Estandares en el Web (WSP): Preguntas Frecuentes (FAQ)</TITLE>

<script type="text/javascript" language="javascript">
<!--  //

if (!document.getElementById) {
    window.location = 
	   "../www.webstandards.org/faqspanish_n4.html"
}

	// -->
</script>

<LINK REL=StyleSheet HREF="wsp.css" TYPE="text/css" MEDIA=screen>

<style type="text/css">
<!--

body {background: #f90 url(css/wasp_top_right.gif) top right no-repeat fixed ;
color: black;}

.menudo {font-size: 13px; padding: 5px;}

-->
</style>

<META NAME="ROBOTS" CONTENT="ALL">
<META NAME="DESCRIPTION" CONTENT="Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browser. Seguir los est&aacute;ndares del W3C es bueno para los usuarios, para los desarrolladores web, para las empresas y para los fabricantes de software. Es bueno para todos.">
<META NAME="KEYWORDS" CONTENT="web standards project browser committee consortium w3c WWWCC netscape microsoft code html css recommended world wide web design programming projectcool glenn davis grassroots organization">
<META NAME="AUTHOR" CONTENT="Jeffrey Zeldman for the Web Standards Project, with kibbitzing from Glenn Davis, Tomas Caspers, et al.">

<BODY onLoad="window.defaultStatus='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'" bgcolor="#FF9900" link="#CC0000" vlink="#CC0000" text="#000000" alink="#FF6633"><!--#include virtual="/outdated.inc" -->

<P>
<A NAME="top">&nbsp;</a></P>

<DIV ALIGN=Center>
<TABLE WIDTH="85%" BORDER=0 CELLPADDING=0 CELLSPACING=0>
<TR><TD BGCOLOR="black">

<TABLE WIDTH="100%" BORDER=0 CELLPADDING=10 CELLSPACING=2>

<!--menu-->
<TR>
<td class="menudo" width="25%" valign="middle" align="center" bgcolor="#cc9900"><A HREF="action.html" onMouseOver="window.status='Lo que estamos haciendo ahora. T&uacute; puedes ayudar!'; return true" ONMOUSEOUT=" window.status ='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">acci&oacute;n</a></TD>

<td class="menudo" width="25%" valign="middle" align="center" bgcolor="#cc9966"><A HREF="mission.html" onMouseOver="window.status='Estatuto de Misi&oacute;n. Nuestras metas y por qu&eacute; son importantes.'; return true" ONMOUSEOUT=" window.status ='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">misi&oacute;n</a></TD>

<td class="menudo" width="25%" valign="middle" align="center" bgcolor="#cc9900"><A HREF="members.html" onMouseOver="window.status='Qui&eacute;n es qui&eacute;n. Unete a nosotros!'; return true" ONMOUSEOUT=" window.status ='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">miembros</a></TD>

<td class="menudo" width="25%" valign="middle" align="center" bgcolor="#cc9900"><A HREF="resources.html" onMouseOver="window.status='Donde puedes encontrar m&aacute;s informaci&oacute;n.'; return true" ONMOUSEOUT=" window.status ='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">recursos</a></TD>
</TR>

<!--bottom-->

<TR>
<TD COLSPAN=4 VALIGN=TOP BGCOLOR="#ffcc99"><A HREF="../www.webstandards.org/index.html" TARGET="_top" onmouseover="window.status='Frontspiece. Webstandards.org home.'; return true" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true"><IMG ALIGN=LEFT SRC="wsp_sm.gif" WIDTH="150" HEIGHT="83" BORDER="0" ALT="The Web Standards Project"></a>
<H2 ALIGN=RIGHT>WaSP FAQ</H2>

<H3 align="right">::: <A HREF="edu_faq.html">Educ.</a><BR>::: <A HREF="faq1.html">English</a></H3>

<P>&nbsp; </P>

<P>
<B>&#191;Qu&eacute; es el Proyecto de Est&aacute;ndares en el Web (WaSP)?</B><BR>

Somos una <A HREF="members.html">coalici&oacute;n internacional</a> formada por destacados dise&ntilde;adores, desarrolladores web y expertos en Internet. Entre nuestros miembros tambi&eacute;n se incluyen desarrolladores peque&ntilde;os y medianos que desean que exista un mayor apoyo a los est&aacute;ndares en el web.
 &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;Por qu&eacute; se form&oacute; el WSP?</B><BR>

Ya hab&iacute;amos perdido la paciencia con las promesas incumplidas, hechas por los fabricantes de <I>browsers</I>, de soportar est&aacute;ndares creados por el Consorcio del World Wide Web (w3C) y otros. Tanto Microsoft como Netscape han insistido que sus productos soportan los est&aacute;ndares. Sin embargo, cada d&iacute;a que pasa seguimos perdiendo enormes cantidades de tiempo y dinero trabajando en crear sitios que funcionen bien en los <I>browsers</I> llenos de errores e incompatibilidades que existen actualmente.<BR> &nbsp; &nbsp; &nbsp; &nbsp; 

Ni Navigator 4.5 ni Internet Explorer 5.0, en sus versiones beta, soportan los est&aacute;ndares del W3C, ni siquiera los est&aacute;ndares que Microsoft y Netscape ayudaron a desarrollar. Es l&oacute;gico concluir que seguiremos encontrando problemas en el futuro, a menos que algo haga que cambie esta situaci&oacute;n. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='El Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuestros browsers.'; return true">Top</a></P>

<P>
<B>&#191;Cu&aacute;les son algunos de los problemas causados por las falta de est&aacute;ndares e incompatibilidades?</B><BR>

<A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true"><IMG align="left" SRC="150wsp.gif" ALT="Wasp image, 2k" WIDTH="150" HEIGHT="97" BORDER="0"></a>
Para los desarrolladores, es frustrante perder el tiempo sac&aacute;ndole la vuelta a incompatibilidades, cuando podr&iacute;amos aprovechar ese tiempo y esfuerzo creando un mejor contenido en nuestros desarrollos. 
<BR> &nbsp; &nbsp; &nbsp; &nbsp; Para las personas y empresas que est&aacute;n pagando por estos sitios, las incompatibilidades significan p&eacute;rdidas y gastos innecesarios en costos adicionales de dise&ntilde;o y desarrollo. 
<BR> &nbsp; &nbsp; &nbsp; &nbsp; Pero, encima de todo, para millones de personas que utilizan el web, las incompatibilidades implican el tener que navegar a trav&eacute;s de p&aacute;ginas que no se despliegan apropiadamente o que ni siquiera funcionan en su <I>browser</I> favorito, si el desarrollador no hizo las pruebas necesarias para que su dise&ntilde;o funcionara bien en cualquier browser.<BR> &nbsp; &nbsp; &nbsp; &nbsp; 

Los desarrolladores Web est&aacute;n m&aacute;s que dispuestos a usar los est&aacute;ndares, pero no pueden hacerlo debido al nivel de soporte que existe actualmente. Tenemos que ignorar algunas nuevas caracter&iacute;sticas de HTML o CSS, o tenemos que crear tres o cuatro versiones diferentes del mismo sitio para que se vea adecuadamente con diferentes <I>browsers</I>. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='El Web Standards Project. Luchando por est&aacute;ndares en nuestros browsers.'; return true">Top</a></P>

<P>
<B>&#191;Cu&aacute;l es el costo de estas incompatibilidades?</B><BR>

Estimamos que las incompatibilidades aumentan en un 25 por ciento el tiempo, esfuerzo  y presupuesto  necesarios para construir un sitio web. 
No solo hablamos del tiempo corrigiendo errores. Tambi&eacute;n se consume tiempo convenciendo a los clientes de que no se puede hacer lo que ellos desean sin tener que crear m&uacute;ltiples versiones del mismo sitio. Se gasta tiempo tambi&eacute;n decidiendo qu&eacute; nivel de <I>browser</I> debemos soportar sin dejar de cumplir con las demandas de los clientes por un sitio de calidad.<BR> &nbsp; &nbsp; &nbsp; &nbsp; 

Pero hay otros costos mayores que no pueden medirse econ&oacute;micamente. Est&aacute; el costo a largo plazo creado por la fragmentaci&oacute;n, debido a que mucha gente no puede aprovechar todo el Web utilizando un solo <I>browser</I>. Este problema crecer&aacute; conforme los usuarios comienzen a usar el Web en sus televisiones, PDAs y otros dispositivos que aparecer&aacute;n en el futuro.&nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;C&oacute;mo se lleg&oacute; a la conclusi&oacute;n de que las incompatibilidades encarecen en un 25 por ciento los costos de desarrollo web?</B><BR>

<A HREF="members.html">Las personas que iniciamos el WSP</A> somos, principalmente, desarrolladores de alto nivel que realizamos sitios sofisticados. Investigamos en nuestras propias oficinas para averiguar qu&eacute; tanto tiempo est&aacute;bamos empleando en resolver problemas causados por errores de programaci&oacute;n  e incompatibilidades.
Usamos listas de correo para preguntarles a otros desarrolladores qu&eacute; tanto tiempo les tomaba resolver estos problemas y hacer pruebas adicionales. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>
Si resolver estos problemas de incompatibilidad no es un asunto de importancia y el tiempo de desarrollo se  reduce en un 25 por ciento, &#191;no significar&aacute; eso que ya no podremos cobrar m&aacute;s por nuestros servicios?</B><BR>

La mayor&iacute;a de las empresas decide primero qu&eacute; tanto puede invertir en un sitio web y luebo buscan proveedores para ver qu&eacute; tanto pueden obtener con dicha cantidad. Si una buena parte de ese presupuesto se va en pruebas de compatibilidad entre browsers y correcci&oacute;n de errores, las empresas obtienen un sitio menos funcional. Para negocios medianos, el sitio resultante puede ser tan peque&ntilde;o que no vale la pena el esfuerzo y, quiz&aacute; sabiamente, deciden no pagar por esto.<BR> &nbsp; &nbsp; &nbsp; &nbsp; 

Lo importante de nuestro esfuerzo actual es que, cuando ya no tengamos que batallar con inconsistencias entre browsers, seremos capaces de ofrecer a nuestros clientes m&aacute;s por su dinero.
<BR> &nbsp; &nbsp; &nbsp; &nbsp; &#191;Har&aacute; &eacute;sto que tengamos menos trabajo o que nuestro trabajo sea mal pagado? Como desarrollador, preg&uacute;ntale a cualquiera de tus clientes si les gustar&iacute;a que el valor de su sitio aumentara en un 25% sin tener que pagar m&aacute;s, y tendr&aacute;s la respuesta.<BR> &nbsp; &nbsp; &nbsp; &nbsp; 

A&uacute;n si tu cliente prefiriese quedarse con los ahorros, eso significar&aacute; que tienes 25 por ciento m&aacute;s de tiempo para desarrollar nuevos proyectos, lo cual sin duda es m&aacute;s interesante que hacer pruebas y corregir errores de tus dise&ntilde;os. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>Si es tan f&aacute;cil desarrollar sitios que funcionen en todos los browsers, &#191;no reducir&aacute; esto el valor de los desarrolladores de sitios web?</B><BR>

A los desarrolladores web que piensan que el &uacute;nico valor que ellos agregan al proceso de desarrollo es la capacidad de resolver incompatibilidades y proporcionar trucos para que las p&aacute;ginas funcionen en todos los browsers, les pedimos que consideren seriamente su labor.<BR> &nbsp; &nbsp; &nbsp; &nbsp; 

Casi cualquier <I>hacker</I> de tercera puede verificar una carta de compatibiliad entre browsers o copiar c&oacute;digo de otro sitio para resolver inconsistencias entre browsers. Pero lo que <B>realmente</B> requiere habilidad y talento es:

<span class="indent">
<BR>  &#150; Desarrollar una arquitectura robusta y con capacidad de crecer, una navegaci&oacute;n intuitiva, y una presentaci&oacute;n est&eacute;tica para un sitio web.

<BR>  &#150; Crear estrategias de mercadotecnia para integrar el web con medios impresos y otros medios tradicionales para comunicar con mayor eficiencia.

<BR>  &#150; Migrar de HTML est&aacute;tico a sitios din&aacute;micos con bases de datos, contenido personalizado y comercio electr&oacute;nico.

<BR>  &#150; Administraci&oacute;n de documentos (publicaci&oacute;n multilingue, determinaci&oacute;n de contenido, control de revisiones, manejo de flujos de trabajo).

<BR>  &#150; Implementar aplicaciones para negocios electr&oacute;nicos que mejoren la productividad de una empresa mediante el adecuado uso de un intranet, extranet o sitio web.
</span> <BR>

Esas son solamente unas cuantas de las &aacute;reas de experiencia que los desarrolladores web proporcionan. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;Por qu&eacute; los desarrolladores no pueden simplemente escribir c&oacute;digo de acuerdo con los est&aacute;ndares del W3C y dejar de usar etiquetas (<I>tags</I>) propietarias?</B><BR>

<A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true"><IMG ALIGN="left" SRC="lwsp.gif" WIDTH="100" HEIGHT="75" HSPACE="4" BORDER="0" alt=""></a>
Adherirse estrictamente a est&aacute;ndares que no tienen apoyo generalizado puede producir sitios que simplemente no funcionen. Desafortunadamente, no todos los browsers soportan las mismas etiquetas (<I>tags</I>) y <I>ninguno de ellos da un soporte completo a todas las etiquetas de HTML.</I><BR> &nbsp; &nbsp; &nbsp; &nbsp; 

A&uacute;n cuando es posible escribir HTML para est&aacute;ndares anteriores del W3C, las limitaciones que ello impondr&iacute;a son inaceptables para muchos de los clientes que est&aacute;n pagando por el desarrollo de su sitio web.&nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>Microsoft y Netscape han dicho que ellos a&ntilde;aden etiquetas (<I>tags</I>) propietarias y nuevas caracter&iacute;sticas porque sus clientes se lo solicitan.</B><BR>

Ser&iacute;a mejor decir que esas compa&ntilde;&iacute;as <STRONG>piensan</STRONG> que eso les dar&aacute; una ventaja competitiva. Ciertamente, los fabricantes de <I>browsers</I> tienen clientes importantes a quienes escuchan. Sin embargo, tales clientes son empresas millonarias que construyen intranets enormes y que requieren que sus empleados utilicen solamente un tipo de browser en particular.<BR> &nbsp; &nbsp; &nbsp; &nbsp;  

Nosotros somos la voz de una buena parte de quienes <I>realmente est&aacute;n construyendo el Web</I>  y tambi&eacute;n de aquellos que quisieran ver un Web que pueda ser utilizado por todos. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;Qu&eacute; tiene de malo que los fabricantes de browsers agreguen nuevas caracter&iacute;sticas a sus productos?</B><BR>

No hay nada de malo en las innovaciones, sino en el hecho de que no se soporten los est&aacute;ndares. El WSP les est&aacute; solicitando a los fabricantes que soporten los est&aacute;ndares existentes (y los propuestos) desarrollados por el W3C y otras organizaciones. Preferimos que hagan esto antes de agregar nuevas etiquetas (<I>tags</I>) y caracter&iacute;sticas propietarias. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;No se rehusar&aacute;n a descontinuar las etiquetas (<I>tags</I>) propietarias que han creado?</B><BR>

Es probable, pero no es lo que nosotros les estamos pidiendo. 
Una vez que se implementen los est&aacute;ndares, si dise&ntilde;amos de acuerdo con los est&aacute;ndares del W3C, el sitio web funcionar&aacute; apropiadamente. 
<BR> &nbsp; &nbsp; &nbsp; &nbsp; Por supuesto, somos libres de utilizar etiquetas (<I>tags</I>) propietarias o innovativas encima de nuestro dise&ntilde;o b&aacute;sico pero depender&aacute; de nosotros reconocer que esas caracter&iacute;sticas adicionales pueden no funcionar en algunos browsers. Por otro lado, para cierto tipo de sitios, como las intranets, esas caracter&iacute;sticas adicionales pueden ser perfectamente apropiadas y convenientes de usar. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>Si los fabricantes dejaran de soportar etiquetas (<I>tags</I>) propietarias, &#191;no se "romper&iacute;a" el web para muchos usuarios?</B><BR>

Por supuesto. Y precisamente por esa raz&oacute;n el WSP no les est&aacute; pidiendo a los fabricantes de browsers que dejen de soportar sus etiquetas (<I>tags </I>) propietarias exisentes. Sin embargo, les estamos solicitando a los fabricantes que fomenten el uso de etiquetas est&aacute;ndares sobre las no est&aacute;ndares cuando exista duplicidad de funciones.&nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;Qu&eacute; es lo que quiere el WSP que hagan los fabricantes de browsers acerca de este problema?</B><BR>

Nuestra principal meta es que exista un soporte completo en las versiones 5.0 de los <I>browsers</I> para Cascading Style Sheets 1 (CSS-1), Document Object Model (DOM) y XML. Para mayores detalles, por favor revisa nuestra <A HREF="missionsp.html">propuesta de misi&oacute;n.</a>  &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

 

<P>
<B>&#191;Qu&eacute; son CSS-1, DOM and XML?</B><BR>

<STRONG>CSS-1</STRONG> proporciona control sobre la apariencia de muchas p&aacute;ginas con un solo archivo, desde la tipograf&iacute;a al comportamiento de los enlaces (<I>links</I>), as&iacute; como un control m&aacute;s preciso sobre la presentaci&oacute;n de la p&aacute;gina. 
<BR> &nbsp; &nbsp; &nbsp; &nbsp; <STRONG>DOM</STRONG> permite a los desarrolladores usar lenguajes tipo script, como ECMAScript (JavaScript), para manipular el texto, las im&aacute;genes y otras partes de las p&aacute;ginas web; por ejemplo, cambiar din&aacute;micamente su apariencia con el tiempo, o mover un objeto hacia dentro de la ventana de visualizaci&oacute;n.
<BR> &nbsp; &nbsp; &nbsp; &nbsp; <STRONG>XML</STRONG> es un "super lenguaje" de marcaje  para muchos tipos de documentos y actividades que permite que la informaci&oacute;n se puede intercambiar entre una p&aacute;gina web y cualquier otro programa que entienda XML.
<BR> &nbsp; &nbsp; &nbsp; &nbsp;Visita nuestra <A HREF="resources.html">Secci&oacute;n de Recursos </a> para obtener mayor informaci&oacute;n acerca de esas tecnolog&iacute;as. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;Qu&eacute; es lo que est&aacute; haciendo el WSP para promover que los fabricantes de <I>browsers</I> se adhieran a los est&aacute;ndares?</B><BR>

Hemos estado haciendo labores de cabildeo con representantes de Microsoft, Netscape y otros fabricantes de <I> browsers</I> que est&aacute;n interesados en trabajar con nosotros en este asunto. <I>Pero nosotros no estamos simplemente esperando que los fabricantes act&uacute;en.</I><BR> &nbsp; &nbsp; &nbsp; &nbsp; 

WSP ha establecido varios <A HREF="ac.html">Comit&eacute;s de Acci&oacute;n</A> para probar los <I>browsers </I>disponibles actualmente, desarrollar herramientas para encontrar c&oacute;mo podr&iacute;an estos soportar los est&aacute;ndares del W3C y para hacer una lista detallada de lo que es necesario mejorar. Estos comit&eacute;s incluyen <A HREF="members.html">expertos ampliamente reconocidos</A> en CSS-1, DOM and XML, y &aacute;reas relacionadas.<BR> &nbsp; &nbsp; &nbsp; &nbsp; 

WSP tambi&eacute;n est&aacute; alentando a los desarrolladores y programadores para que colaboren en el esfuerzo de Netscape para corregir errores en el <A HREF="wfw/ng.html">NGLayout Engine</A> de Netscape, el cual est&aacute; encaminado a hacer que se cumpla al 100 por ciento con CSS-1 y DOM, y el cual puede incluirse o no en Navigator 5.0, as&iacute; que si crees que &eacute;sto es importante, <A HREF="indexalt.html">comun&iacute;caselo a Netscape</A>. Tambi&eacute;n impulsaremos que la gente pueda ayudar de manera similar apoyando a Microsoft o cualquier otro fabricante que quiera abrir de alguna forma sus esfuerzos de desarrollo.<BR> &nbsp; &nbsp; &nbsp; &nbsp; 

Por supuesto, seguiremos dando a conocer estos t&oacute;picos y mantendremos la presi&oacute;n p&uacute;blica. Varios de nuestros Comit&eacute;s de Acci&oacute;n est&aacute;n canalizando las preocupaciones de grupos espec&iacute;ficos tales como organizaciones acad&eacute;micas, departamentos de IT corporativos y proveedores de servicios de Internet. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;No lesionar&aacute;n los est&aacute;ndares a Netscape/Microsoft (u otro fabricante de tu elecci&oacute;n)?&#191; No les restar&aacute;n los est&aacute;ndares capacidad de competencia?</B><BR>

Todos perdemos si los fabricantes de <I>browsers</I> siguen su propio camino al romper el Web. El Web solo existe para los <I>browsers</I> si las p&aacute;ginas se pueden desplegar bien. Si lo &uacute;nico que los <I>browsers</I> pueden distinguir son est&aacute;ndares primarios de hace 5 a&ntilde;os, entonces el Web no funciona.<BR> &nbsp; &nbsp; &nbsp; &nbsp; 

Sony y Toshiba compiten, pero ambos fabrican televisores que cumplen con los est&aacute;ndares de NTSC. De manera similar, los fabricanes de browsers deben ser capaces de soportar completamente los est&aacute;ndares, sin dejar de ser saludablemente competitivos entre s&iacute; a trav&eacute;s de mecanismos como rapidez, manejo de bookmarks, clientes de email o noticias. En una palabra, pueden existir browsers de todos los sabores y colores. Pero si el <I>browser</I> (hojeador) no es capaz de hojear el web, entonces tal vez puedan ganar una batalla pero seguramente perder&aacute;n la guerra. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;Cu&aacute;l es su opini&oacute;n acerca del <I>browser</I> Opera, el cual es promovido como un <I>browser </I>que se adhiere estrictamente a los est&aacute;ndares?</B>
<BR>
Aun cuando ning&uacute;n <I>browser</I> ofrece un soporte completo a los est&aacute;ndares de W3c, W3C, Opera ha hecho un buen trabajo al poner atenci&oacute;n a este asunto. De hecho, <A HREF="news.html#opera">Opera se adhiri&oacute; a los esfuerzos del WSP</A> desde nuestro primer d&iacute;a. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;Por qu&eacute; se deber&iacute;an preocupar los fabricantes por los est&aacute;ndares en el Web?</B><BR>

Deber&iacute;a considerarse un beneficio el tener un soporte total de Cascading Style Sheets-1, Document Object Model (DOM) y XML. 
De otra forma, los desarrrolladores seguir&aacute;n evitando esas nuevas tecnolog&iacute;as. Esas, justmente, son el tipo de caracter&iacute;sticas con que los fabricantes de <I>browsers</I> est&aacute;n contando para que m&aacute;s gente use sus productos. Pero la mayor&iacute;a de los desarrolladores no puede construir sitios con esas nuevas caracter&iacute;sticas, ya que pocos clientes pueden pagar las correcciones de errores y versiones m&uacute;ltiples que son necesarias para hacer frente a <I>browsers</I> incompatibles entre s&iacute;. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;Seguir&aacute;n siendo los est&aacute;ndares en el Web solamente un sue&ntilde;o?</B><BR>

Si no actuamos, seguramente. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<B>&#191;Qu&eacute; puedo yo hacer para ayudar a que haya un mejor soporte de est&aacute;ndares?</B><BR>

Puedes estar enterado, revisando el sitio del WSP, y leyendo las actualizaciones regulares de <A HREF="wfw/index.html">The Word from the WaSP</a> para conocer nuestro punto de vista sin cortapisas. El WaSP ("avispa" N. del T.) puede "picar" ya que la verdad a veces duele. (La verdad no "pica" pero incomoda.  Aportaci&oacute;n del T.)
<BR> &nbsp; &nbsp; &nbsp; &nbsp; 
Puedes programar y crear c&oacute;digo, participando en el desarrollo del <A HREF="wfw/ng.html">NGlayout para Mozilla</A>, 
ayudando a que al menos uno de los dos principales browsers  pueda lograr cumplir con los est&aacute;ndares..
<BR> &nbsp; &nbsp; &nbsp; &nbsp; Tambi&eacute;n puedes actuar: &uacute;nete a un <A HREF="ac.html">Comit&eacute; de Acci&oacute;n,</a> difunde nuestra misi&oacute;n inform&aacute;ndole a tus colegas y clientes acerca del WSP, coloca un <A HREF="banners.html">anuncio del WSP</A> en tu sitio web, y toma parte en actividades y <A HREF="action.html">acciones del WSP</A>. &nbsp; &nbsp; <A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">Top</a></P>

<P>
<A HREF="#top" onmouseover="window.status='Return to top.'; return true;" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true"><IMG align="right" SRC="150wsp.gif" ALT="Wasp image, 2k" WIDTH="150" HEIGHT="97" BORDER="0"></a> &nbsp;</P>

<BR CLEAR="all">
<DIV ALIGN=CENTER CLASS="footer">
&copy; 1998-2001   Web Standards Project,  <A HREF="../www.webstandards.org/index.html" TARGET="_top" onmouseover="window.status='Frontspiece. Webstandards.org home.'; return true" onmouseout="window.status='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">www.webstandards.org</A>
</DIV></TD></TR>

<!--menu-->
<TR>
<td class="menudo" width="25%" valign="middle" align="center" bgcolor="#cc9900"><A HREF="action.html" onMouseOver="window.status='Lo que estamos haciendo ahora. T&uacute; puedes ayudar!'; return true" ONMOUSEOUT=" window.status ='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">acci&oacute;n</a></TD>

<td class="menudo" width="25%" valign="middle" align="center" bgcolor="#cc9966"><A HREF="mission.html" onMouseOver="window.status='Estatuto de Misi&oacute;n. Nuestras metas y por qu&eacute; son importantes.'; return true" ONMOUSEOUT=" window.status ='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">misi&oacute;n</a></TD>

<td class="menudo" width="25%" valign="middle" align="center" bgcolor="#cc9900"><A HREF="members.html" onMouseOver="window.status='Qui&eacute;n es qui&eacute;n. Unete a nosotros!'; return true" ONMOUSEOUT=" window.status ='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">miembros</a></TD>

<td class="menudo" width="25%" valign="middle" align="center" bgcolor="#cc9900"><A HREF="resources.html" onMouseOver="window.status='Donde puedes encontrar m&aacute;s informaci&oacute;n.'; return true" ONMOUSEOUT=" window.status ='Proyecto de Est&aacute;ndares en el Web. Luchando por est&aacute;ndares en nuetros browsers'; return true">recursos</a></TD>
</TR>

<!--bottom-->

</TABLE>

<!--outer table-->
</TD></TR>
</TABLE>

</DIV>

<BR CLEAR=ALL> <BR>

</BODY>

<!-- Mirrored from archive.webstandards.org/faqspanish.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 18 Aug 2017 18:20:21 GMT -->
</HTML>