<html>

<!-- Mirrored from archive.webstandards.org/Press_Release_WSP_German.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 18 Aug 2017 18:32:15 GMT -->
<head>
<title>WebStandards Project Pressemitteilung</title>
</head>
<body bgcolor="#FFFFFF"><!--#include virtual="/outdated.inc" -->
<p>
Zur sofortigen Ver&ouml;ffentlichung
</p>
<p>
Browser-Inkompatibilit&auml;ten erh&ouml;hen die Kosten f&uuml;r
Websites und drohen das Web endg&uuml;ltig zu fragmentieren
</p>
<p>
Los Angeles, K&ouml;ln, August 1998 - Die Kosten f&uuml;r die
Erstellung von Websites werden durch Inkompatibilit&auml;ten zwischen
den Browsern um mindestens 25 Prozent erh&ouml;ht. Das verlautete von
"<a href="../www.webstandards.org/index.html">The Web Standards Project</a>"
(WSP), einer neu gegr&uuml;ndeten, internationalen Koalition von
f&uuml;hrenden Entwicklern, die sich f&uuml;r die Einhaltung von
etablierten Standards im Web- und Browser-Design einsetzt. WSP fordert
die Browserhersteller auf, zu den im Juli 1997 gemachten Verprechen zu
stehen und dr&auml;ngen sie, die vom <a href="http://www.w3c.org/">World
Wide Web Consortium</a> (W3C) aufgestellten Standards mit den kommenden
Browserversionen voll zu unterst&uuml;tzen und dar&uuml;ber hinaus auch
die neuen Standards, die entwickelt werden, zu unterst&uuml;tzen.
</p>
<p>
Sonst, so behauptet WSP, werden weiterhin jedes Jahr Millionen auf die
Entwicklung von Webseiten verschwendet. "Die Zeit der propriet&auml;ren
Innovation bei Webbrowsern ist Vergangenheit", sagt <a
href="mailto:gdavis%40jupiter.projectcool.com">Glenn Davis</a> , Chief
Technology Officer bei <a href="http://www.projectcool.com/">Project
Cool, Inc</a>., einer Organisation mit Ressourcen und Material f&uuml;r
Web-Entwickler. "Es wird Zeit, da&szlig; die Browser die zentralen
W3C-Standards unterst&uuml;tzen - Standards, an deren Entwicklung
Microsoft und Netscape beteiligt waren und deren Unterst&uuml;tung sie
zugesagt hatten - so da&szlig; Entwickler von Webseiten mehr Zeit
darauf verwenden k&ouml;nnen, bessere Seiten zu entwickeln und weniger
Zeit darauf, mit Inkompatibilit&auml;tsproblemen zwischen den Browsern
zu k&auml;mpfen, was f&uuml;r alle, auf allen Ebenen des Webs,
unn&ouml;tige Kosten verursacht."
</p>
<p>
Derzeit enthalten die Beta-Versionen von sowohl Netscape Navigator 4.5
als auch Microsoft Internet Explorer 5.0 weitere propriet&auml;re
Verbesserungen, ohne die existierenden Standards voll zu
unterst&uuml;tzen. WSP glaubt, da&szlig; die Beseitigung der
derzeitigen l&uuml;ckenhaften Unterst&uuml;tzung von HTML, Cascading
Style Sheets, Document Object Model und ECMAScript von entscheidender
Bedeutung ist, da die 5.0-Versionen durch ihre Unterst&uuml;tzung von
XML wahrscheinlich eine neue &Auml;ra f&uuml;r Desktop-Browser
einleiten wird. "Da Web-Entwickler mehrere Versionen erstellen oder
zeitraubende Workarounds entwickeln m&uuml;ssen, um Besucher mit
unterschiedlichen Browsern zu bedienen, scheuen sie sich aufgrund der
zus&auml;tzlichen Kosten davor, proptiet&auml;re Funktionalit&auml;ten
zu nutzen", sagt <a href="mailto:golsen%402lm.com">George Olsen</a> ,
Design Director und Web-Architekt bei <a
href="http://www.2lm.com/">2-Lane Media</a> in Los Angeles. "Obwohl
manche Kunden diese Funktionalit&auml;ten einbegettet sehen wollen, so
sind doch wenige von Ihnen bereit, f&uuml;r die mehrfache Erstellung
der Seite zu bezahlen."
</p>
<p>
Das Fehlen gemeinsamer Standards f&uuml;hrt, zus&auml;tzlich zu der
Erh&ouml;hung der Kosten f&uuml;r Webseiten, zu einem Gef&uuml;hl der
Frustration unter den Entwicklern, die sich der immer schwierigeren
Aufgabe, Workaround und Bugfixes zu erstellen, gegen&uuml;bersehen.
"Die meisten meiner Design-Ideen sind wirklich einfach, aber diese
konsistent sowohl &uuml;ber Internet Explorer 3 & 4 als auch &uuml;ber
Navigator 3 & 4 auszuf&uuml;hren ist alles andere als einfach", sagt <a
href="mailto:jeffrey%40zeldman.com">Jeffrey Zeldman</a> , ein <a
href="http://www.zeldman.com/">Entwickler/Designer</a> aus New York.
"Ich mu&szlig; zeitintensive Workarounds entwicklen, um ein sehr
grundlegendes Design, das funktioniert, zu erreichen."
</p>
<p>
Das Fehlen der durchgehenden Unterst&uuml;tzung f&uuml;r gehobene
Pr&auml;sentationsstandards wie Cascading Style Sheets hat, laut WSP,
auch langfristige Auswirkungen. W&auml;hrend die Schwierigkeit, neue Workarounds
zus&auml;tzlich zu den alten zu entwickeln, zunimmt, werden die
Entwickler auf einfachere L&ouml;sungen statt auf Langlebigkeit
konzentrieren. "Durch das Fehlen von Standards f&uuml;r diese
gro&szlig;artigen Technologien tendieren wir dazu, Wegwerfinhalte zu
entwicklen statt uns an eine langfristige, solide Basis zu halten",
sagt <a href="mailto:MDiekhoff%40getty.edu">Martin Dieckhoff</a> ,
Web/Applications Developer beim <a
href="http://www.gii.getty.edu/">Getty Information Institute</a>.
</p>
<p>
<a href="mailto:fahrner%40pobox.com">Todd Fahner</a> , Design
Technologist bei <a href="http://www.verso.com/">Studio Verso</a> in San
Francisco , f&uuml;gt hinzu: "Browserhersteller sollten versuchen, dies
auf lange Sicht zu sehen und realisieren, da&szlig; das &Uuml;berleben
des "Browserkriegs" nicht viel z&auml;hlt, wenn das Web selber
auseinanderf&auml;llt. Die Standards unterst&uuml;tzen mag wie ein
altruistisches Ziel in einem Markt mit Konkurrenz klingen, aber
Entwickler und ihre Kunden verlieren ihre Geduld bei der nicht
kompromi&szlig;losen Unterst&uuml;tzung von so grundlegenden Standards
wie CSS1." Das augenblickliche Problem wird mit dem Erscheinen von
WebTV- und PDA-basierten Webbrowsern nur weiter kompliziert"; sagt <a
href="mailto:ann%40webgeek.com">Ann Navarro</a> , Besitzerin von <a
href="http://www.webgeek.com/">WebGeek Communications</a>  in Carmel
Valley, Kaliforniern, und Vorsandsmitglied der <a
href="http://www.hwg.org/">HTML Writers Guild</a>. Navarro sagt,
da&szlig; WSP die Browserhersteller ebenfalls dazu dr&auml;ngt, an den
Bem&uuml;hungen der neu geformten Mobile Access-Gruppe des W3C, die
Standards f&uuml;r Browser, die auf PDA und Mobiltelefonen entwickeln
wird, teilzunehmen und diese zu unterst&uuml;tzen.
</p>
<p>
------
</p>
<p>
&Uuml;ber das <a href="../www.webstandards.org/index.html">Web Standards
Project</a> : Das Hauptziel von WSP ist es, die Webentwicklungsbranche
zu f&ouml;rdern. Die Bem&uuml;hungen, auf die bestehenden und
potentiellen Probleme, die in Verbindung mit
Browserinkompatibilit&auml;ten stehen, aufmerksam zu machen bedeutet
nicht, da&szlig; WSP gegen Innovationen der Browserhersteller ist. Die
Koalition dr&auml;ngt Browserhersteller lediglich dazu, offene
Standards f&uuml;r Verbesserungen zu benutzen und l&auml;ngst
bestehende Standards zu unterst&uuml;tzen, bevor neue
Funktionalit&auml;ten hinzugef&uuml;gt werden.
</p>
<p>
------
</p>
<p>
Falls Sie sich entschlie&szlig;en, etwas &uuml;ber uns zu
ver&ouml;ffentlichen, w&uuml;rden wir uns &uuml;ber eine kurze
Nachricht (evtl. mit URL) freuen. F&uuml;r weitergehende Informationen
stehen wir Ihnen gerne zur Verf&uuml;gung.
</p>
<p>
Kontakt USA:<br>
George Olsen - 2 Lane Media<br>
Fon: +1-310-473-3706<br>
<a href="mailto:golsen%402lm.com">mailto:golsen%402lm.com</a><br>
<a href="http://www.2lm.com/">http://www.2lm.com/</a>
</p>
<p>
Kontakt Europa:<br>
Tomas Caspers - Artware Design<br>
Halfenshof - Hohn 10 -<br>
53783 Eitorf<br>
Fon: +49-2243-840130<br>
Fax: +49-2243-840131<br>
<a href="mailto:tomas%40artware.de">mailto:tomas%40artware.de</a><br>
<a href="http://www.artware.de/">http://www.artware.de/</a>
</p>
</body>

<!-- Mirrored from archive.webstandards.org/Press_Release_WSP_German.html by HTTrack Website Copier/3.x [XR&CO'2014], Fri, 18 Aug 2017 18:32:15 GMT -->
</html>

